Repository: krolik1591/chat
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: uk

source: CHECK_REF_DENIED_TEXT
uk: Невірне реферальне посилання. Уважніше.

source: CHECK_REF_APPROVE_TEXT
uk: <a href='tg://user?id={id}'>{name}</a> став вашим поддіваном

source: DICE_ROLL_TEXT
uk: 🍀 Успіхів!

source: GAME_ERR_BET_TOO_BIG
uk: ❌ Ставка більше балансу!

source: GAME_ERR_BET_NOT_SELECTED
uk: ❌ Не обраний результат ставки!

source: LOSE_TEXT
uk: Наступного разу пощастить!

source: WIN_TEXT
uk: Перемога! Ізі + {score_change} {token_icon}

source: DARTS_BOWLING_BASKET_FOOTBALL_TEXT_1
uk: 😐 Мимо

source: BASKET_TEXT_2
uk: 😲 Майже влучив

source: BASKET_TEXT_3
uk: 😵 Застряг

source: DARTS_TEXT_5_OR_BASKET_4
uk: 👌 <b>Гарне влучання ✅ Ви виграли {score_change}</b> {token_icon}

source: BASKET_TEXT_5
uk: 🤑 <b>ЧИСТЕ ВЛУЧАННЯ! 🤑 ✅ Ви виграли {score_change}</b> {token_icon}

source: DARTS_OR_BOWLING_TEXT_2
uk: 🙄 Не пощастило

source: DARTS_OR_BOWLING_TEXT_3
uk: 😲 Гарна спроба

source: DARTS_TEXT_4
uk: 👌 <b>Непогано ✅ Ви виграли {score_change}</b> {token_icon}

source: DARTS_TEXT_6
uk: 🍎 <b>ПРЯМО В ЦІЛЬ! 🍏 ✅ Ви виграли {score_change}</b> {token_icon}

source: BOWLING_TEXT_4
uk: 🤐 Без коментарів...

source: BOWLING_TEXT_5
uk: СТРАААЙ... А ні, здалося)

source: BOWLING_TEXT_6
uk: 🤑 <b>СТРАААЙК! 🤑 ✅ Ви виграли {score_change}</b> {token_icon}

source: FOOTBALL_TEXT_LOSE
uk: 🙄 Відскочив...

source: FOOTBALL_TEXT_WIN
uk: 🤑 <b>ГОООООООЛ! 🤑 ✅ Ви виграли {score_change}</b> {token_icon}

source: CUBE_TEXT_0
uk: {dice_number_emoji} ✅ Ви виграли {score_change} {token_icon}

source: CUBE_TEXT_1
uk: {dice_number_emoji} 🙄 На жаль, вам не пощастило

source: CUBE_TEXT_2
uk: {dice_number_emoji} 🤐 Дідько, знов не пощастило

source: CUBE_TEXT_3
uk: {dice_number_emoji} 🔥 Вже {cube_lose_streak} раз не щастить

source: DICE_GAMES_NUMBERS_CUBE_EMOJI_1
uk: 1️⃣ <b>- непарне</b>

source: DICE_GAMES_NUMBERS_CUBE_EMOJI_2
uk: 2️⃣ <b>- парне</b>

source: DICE_GAMES_NUMBERS_CUBE_EMOJI_3
uk: 3️⃣ <b>- непарне</b>

source: DICE_GAMES_NUMBERS_CUBE_EMOJI_4
uk: 4️⃣ <b>- парне</b>

source: DICE_GAMES_NUMBERS_CUBE_EMOJI_5
uk: 5️⃣ <b>- непарне</b>

source: DICE_GAMES_NUMBERS_CUBE_EMOJI_6
uk: 6️⃣ <b>- парне</b>

source: REFERRALS_PROMO_TO_GENERAL_NO_MORE_MONEY
uk: Недостатньо токенів для виведення. Мінімальна сума для виведення - {min_ref_withdraw} токенів.

source: REFERRALS_PROMO_TO_GENERAL_SUCCESS
uk: Токени виведені на головний баланс!

# REFERRALS_SEND_INVITATION_TITLE_TEXT
source: HI!
uk: Здарова

# REFERRALS_SEND_INVITATION_DESC_TEXT
source: HI, BRO!
uk: Здарова заебал

# REFERRALS_SEND_INVITATION_TEXT
source: HI, BRO, CMON PLAY WITH ME!
uk: Здарова заебал заходь

# REFERRALS_SEND_INVITATION_BTN_TEXT
source: GO!
uk: Іду

source: SETTINGS_LANG_CHANGED
uk: Мову змінено!

source: MENU_TEXT
uk: 💵 Баланс: {balances} Поїхали?

source: MAIN_MENU_BTN_GAMES
uk: 🎲 Ігри

source: MAIN_MENU_BTN_WHEEL_OF_FORTUNE
uk: 🍀 Колесо фортуни

source: MAIN_MENU_BTN_DEPOSIT
uk: 💎 Гаманець

source: MAIN_NEMU_BTN_ACCOUNT
uk: 👤 Аккаунт

source: MAIN_BTN_CHANGE_LANG
uk: 🌐 Мова: {lang}

source: MAIN_MENU_BTN_GUIDES
uk: 🎓 Гайди

source: MAIN_MENU_BTN_SUPPORT
uk: 💬 Підтримка

source: SELECT_BALANCE_BTN_DEMO
uk: DEMO

source: SELECT_BALANCE_BTN_PROMO
uk: PROMO

source: SELECT_BALANCE_BTN_GENERAL
uk: GENERAL

source: ACCOUNT_MENU_BTN_REFERRALS
uk: Реферали

source: ACCOUNT_MENU_BTN_PROMO_CODES
uk: Промокоди

source: ACCOUNT_MENU_BTN_TROPHIES
uk: Трофеї

source: ACCOUNT_MENU_BTN_SEND_GIFT
uk: Відправити подарунок

source: ACCOUNT_MENU_SETTINGS
uk: Налаштування

source: REF_LVL_1_ADEPT
uk: Адепт

source: REF_LVL_2_EXPERIENCED
uk: Досвідчений

source: REF_LVL_3_CONNOISSEUR
uk: Знавець

source: REF_LVL_4_EXPERT
uk: Експерт

source: REF_LVL_5_MAESTRO
uk: Маестро

source: REFERRAL_MENU_TEXT
uk: Запрошуйте друзів та отримайте <b>до 15%</b> від всіх їх ставок. Виграшних та програшних. Кількість рефералів: {referrals_count} Всього зароблено: {all_profit} 💎 Виведено на ігровий баланс: {total_ref_withdraw} 💎 Доступно для виводу: {money_to_withdraw} 💎 Ваш рівень: {ref_level_name} Посилання для запрошень: <code>{invite_link}</code>

source: REFERRALS_MENU_SEND_INVITE
uk: Відправити запрошення

source: REFERRALS_MENU_SEND_PROMO_TO_GENERAL
uk: Вивести на ігровий баланс

source: REFERRALS_MENU_HOW_IT_WORKS
uk: Як це працює?

source: BTN_BACK
uk: ‹ Назад

source: SLOTS_PLAY_TEXT
uk: 🎰 Крутити!

source: FOOTBALL_PLAY_TEXT
uk: ⚽ Удар!

source: DARTS_PLAY_TEXT
uk: 🎯 Кинути!

source: CUBE_PLAY_TEXT
uk: 🎲 Кубісь!

source: DEFAULT_PLAY_TEXT
uk: Грати

source: DEFAULT_BALANCE_TEXT
uk: Ваші гроши: <b>{balance}</b> Обери розмір ставки:

source: BET_MENUS_BTN_MINIMUM
uk: Мінімум

source: BET_MENUS_BTN_MAXIMUM
uk: Максимум

source: BET_MENUS_BTN_GIVEMEMONEY
uk: Віддай гроші

source: CUBE_SETTINGS_TEXT
uk: Баланс: <b>{balance}</b> {token_icon} Сума усіх ставок: {general_bet} Обери суму ставки та на що ставиш:

source: CUBE_BET_BUTTON
uk: ⚙️ Ставка • {bet} {token_icon}

source: CUBE_SETTINGS_BTN_EVEN
uk: Парне

source: CUBE_SETTINGS_BTN_ODD
uk: Непарне

source: CUBE_SETTINGS_BTN_RESET_ALL_BETS
uk: Обнуляємось

source: SELECT_BALANCE_BTN_RULES
uk: Правила

source: SELECT_GAME_BTN_CASINO
uk: 🎰 Казино

source: SELECT_GAME_BTN_CUBE
uk: 🎲 Кубик

source: SELECT_GAME_BTN_BASKET
uk: 🏀 Баскет

source: SELECT_GAME_BTN_DARTS
uk: 🎯 Дартс

source: SELECT_GAME_BTN_BOWLING
uk: 🎳 Боулінг

source: SELECT_GAME_BTN_FOOTBALL
uk: ⚽️ Футбол

source: SELECT_GAME_BTN_MINES
uk: 💣 Міни

source: SELECT_GAME_BTN_CUEFA
uk: ✌️ ЦУ-Е-ФА

source: LANGUAGE_TEXT
uk: Обери потрібну мову:

source: DEPOSIT_ACCOUNT_INITIATED
uk: ✅ Одноразовиій платіж за ініціацію вашого особистого TON-гаманця ({init_pay_ton} TON) пройшов успішно :)

source: DEPOSIT_INITIATION_ERROR
uk: ❌ Недостатньо коштів! Одноразовий платіж за ініціацію вашого особистого TON-гаманця - {init_pay_ton} TON

source: DEPOSIT_SUCCESSFUL
uk: ✅ Баланс успішно поповнений на {amount}💎! Вдалих спінів, друже 😉

source: DEPOSIT_MENU_TEXT
uk: 📥 <b>Поповнити Toncoin</b> Переведіть <b>Toncoin</b> на свою депозитну адресу в <b>The Open Network – TON</b> <b>Адреса</b>: <code>{wallet_address}</code>

source: DEPOSIT_MENU_BTN_OPEN_TONKEEPER
uk: Відкрити Tonkeeper

source: DEPOSIT_MENU_BTN_OPEN_TONKEEPER2
uk: Відкрити Tonkeeper

source: WALLET_MENU_TEXT
uk: 💸 <b>Мій гаманець</b> <b>Баланс</b>: {balances} <b>Курс</b>: {token_price}💎 = 1 TON

source: WALLET_MENU_BTN_DEPOSIT
uk: 📥 Поповнити

source: WALLET_MENU_BTN_WITHDRAW
uk: 📤 Вивести

source: WALLET_MENU_BTN_HOW_TO_BUY
uk: 💳 Як придбати TON?

source: WITHDRAW_MENU_TEXT1
uk: 📤 Виведення • крок 1/3 Ваш баланс: {general_balance} 💎 ⚠️ Мін. сума виведення: {min_withdraw} 💎 ({ton_amount} TON) Надішліть суму 💎 для виведення:

source: WITHDRAW_MENU_TEXT2
uk: 📤 Виведення • крок 2/3 Надішліть адресу вашого гаманця:

source: WITHDRAW_MENU_TEXT3
uk: 📤 Виведення • крок 3/3 <b>Ваш баланс:</b> {general_balance} 💎 Сума: {user_withdraw_amount} 💎 ({user_withdraw_amount_ton} TON) Адрес: <code>{user_withdraw_address}</code> Підтвердіть або надішліть іншу кількість 💎 на виведення

source: WITHDRAW_MENU_BTN_STEP_3_APPROVE
uk: ✅ Підтвердити

source: WITHDRAW_APPROVE
uk: ✅ Заявка на виплату {user_withdraw_amount_ton} TON • {user_withdraw_amount} 💎 прийнята!

source: WITHDRAW_MENU_BTN_STEP_4_TO_MENU
uk: На головну

source: ADMIN_APPROVE_TX
uk: Адмін схвалив вашу транзу на виведення {amount} 💎! Очікуйте поповнення :)

source: ADMIN_REJECT_TX
uk: Транза відхилена адміном. Токени повернені на баланс

source: PAYMENT_CONFIRMED
uk: ✅ Гроші ({ton_amount} TON) зараховані на ваш рахунок!

source: PAYMENT_DENIED
uk: ❌ Гроші ({ton_amount} TON) не зараховані, токени повернені на баланс.

source: PAYMENT_LOST
uk: Транзакція на вивід {ton_amount} TON загублена блокчейном, токени повернені на баланс.

source: PREVIOUS_WITHDRAW_IN_PROCESS
uk: Дочекайтесь оброблення попередньої транзакції

source: REACHED_DAILY_LIMIT
uk: Досягнутий денний ліміт на вивід! Сьогодні ще можна вивести: {allowable_amount} 💎

source: WITHDRAW_TOO_BIG
uk: Максимальний денний ліміт - {daily_limit} 💎 ({daily_limit_token} TON)

source: AMOUNT_TOO_SMALL
uk: Мінімальна сума для виведення: {min_withdraw} 💎 ({ton_amount} TON)

source: INSUFFICIENT_FUNDS_MASTER
uk: На мастер-рахунку не вистачає грошей. Токени повернені на баланс

source: INSUFFICIENT_FUNDS
uk: ❌ Бажаної суми виводу нема на вашому рахунку

source: WRONG_ADDRESS
uk: ❌ Невірно введено адресу

source: TON_TESTNET_ADDRESS
uk: ❌ Голова, це тест-нетівська адреса, будь уважніше
