# TODO i18n

DEFAULT_BALANCE_TEXT = 'Ваші гроши: {balance}\n\nОбери розмір ставки:'

MENU_TEXT = 'Баланс:\n{balances}\nПоїхали?'
BALANCE_TEXT = '{icon}{name}: {amount}'

DEPOSIT_MENU_TEXT = 'Мій гаманець \n\nБаланс: \n\n{balances} \n\nКурс: #todo'
REPLENISH_MENU_TEXT = 'Поповнити Toncoin\n\nПереведіть Toncoin на свою депозитну адресу в The Open Network – TON\n\n' \
                      'Адреса:\n<code>{wallet_address}</code>'
SUCCESSFUL_REPLENISH_MENU = 'Баланс успішно поповнений на {amount}💎!\n\nВдалих спінів, друже 😉'

WITHDRAW_MENU_TEXT1 = 'Виведення • крок 1/3 \n\nМін. сума виведення: 50💎 (0.5 TON)\n\nНадішліть суму 💎 для виведення:'
WITHDRAW_MENU_TEXT2 = 'Виведення • крок 2/3 \n\nНадішліть адресу вашого гаманця:'
WITHDRAW_MENU_TEXT3 = 'Виведення • крок 3/3 \n\nСума: {user_withdraw_amount} 💎 ({user_withdraw_amount_ton} TON)\nАдрес:\n{user_withdraw_address}\n\n' \
                      'Підтвердіть або надішліть іншу кількість 💎 на виведення'
WITHDRAW_APPROVE = '✅ Заявка на виплату {user_withdraw_amount_ton} TON • {user_withdraw_amount} 💎 прийнята!\n\n' \
                   'Кошти будуть зараховані напротязі 24 годин'

WITHDRAW_ERR1 = 'Мінімальна сума для виведення: 50💎 (0.5 TON)'
WITHDRAW_ERR2 = 'Введена сума більша за ваш баланс'
WITHDRAW_ERR3 = 'Голова, це тест-нетівська адреса, будь уважніше'
WITHDRAW_ERR4 = 'Невірно введено адресу'
WITHDRAW_ERR5 = 'Бажаної суми виводу нема на вашому рахунку'
WITHDRAW_ERR6 = 'Все. Пізда.'

PAYMENT_CONFIRMED = 'Гроші зараховані на ваш рахунок!'
PAYMENT_DENIED = 'Гроші не зараховані, треба щось з цим зробити'




DEMO_FUNDS_ICON = '🍬'
TON_FUNDS_ICON = '🍭'

DEFAULT_PLAY_TEXT = 'Грати'

FOOTBALL_PLAY_TEXT = "⚽ ️Kick"
DARTS_PLAY_TEXT = "🎯 ️Darts"
SLOTS_PLAY_TEXT = "🎰 ️Slots"
