DEFAULT_BALANCE_TEXT = 'Ваші гроши: <b>{balance}</b>\n\nОбери розмір ставки:'

BALANCE_TEXT = '{icon}{name}: <b>{amount}</b>'
SETTING_TEXT = 'Вітаю у налаштуваннях!\n\nА ви вже налаштувались взяти баночку?'
LANGUAGE_TEXT = 'Обери потрібну мову:'
CABINET_MENU_TEXT = 'Дякую тобі мій мілорд за науку. Я створив цю затишну домівку для твоїх синів та моїх братів. \n' \
                    'StillNoWoman.'
REFERRAL_MENU_TEXT = 'Запрошуйте друзів та отримайте <b>до 15%</b> від всіх їх ставок. Виграшних та програшних.\n\n' \
                     'Кількість рефералів:\n' \
                     'Всього зароблено:\n' \
                     'Виведено на ігровий баланс:\n' \
                     'Ваш рівень:\n\n' \
                     'Посилання для запрошень: <code>{invite_link}</code>'
CHECK_REF_DENIED_TEXT = 'Невірне реферальне посилання. Уважніше.'
CHECK_REF_APPROVE_TEXT = '<a href="tg://user?id={id}">{name}</a> став вашим поддіваном'


DEMO_FUNDS_ICON = '🐠'
TON_FUNDS_ICON = '💎'
PROMO_FUNDS_ICON = '🎁'
